#### Terraform Format and Style 🖌`success`
#### production - Terraform Initialization ⚙️`success`
#### production - Terraform Validation 🤖Success! The configuration is valid.


#### production - Terraform Plan 📖`success`

<details><summary>production - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"]: Refreshing state... [id=t7FkZ3VyrruPNDAijW0kww]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"]: Refreshing state... [id=g2vmw5_ZvyUrKPv8jKBRKQ]
module.datarepo-app.module.cloudsql.random_id.root_user_password[0]: Refreshing state... [id=MhNUqvJm2Mlbx-sJadLRSw]
module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0]: Refreshing state... [id=GU6X8it2Z8Y]
module.core-infrastructure.module.k8s-master.data.google_container_engine_versions.cluster_versions: Refreshing state... [id=2020-12-08 15:23:15.872731979 +0000 UTC]
module.core-infrastructure.module.k8s-master.data.google_project.project: Refreshing state... [id=projects/terra-datarepo-production]
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=terra-datarepo-production/cloudresourcemanager.googleapis.com]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/terra-datarepo-production/global/sslPolicies/global-ssl-policy]
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=terra-datarepo-production/serviceusage.googleapis.com]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/terra-datarepo-production/global/securityPolicies/broad-cloud-armor]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=terra-datarepo-production/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=terra-datarepo-production/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=terra-datarepo-production/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=terra-datarepo-production/logging.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=terra-datarepo-production/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=terra-datarepo-production/dns.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=terra-datarepo-production/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=terra-datarepo-production/servicenetworking.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=terra-datarepo-production/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=terra-datarepo-production/storage-api.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=terra-datarepo-production/storage-component.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=terra-datarepo-production/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=terra-datarepo-production/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=terra-datarepo-production/compute.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=terra-datarepo-production/sql-component.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=terra-datarepo-production/container.googleapis.com]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/terra-datarepo-production/global/networks/production-network]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/subnetworks/production-subnet]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=terra-datarepo-production/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-nodes["jade-node-us-central-1"].google_container_node_pool.pool: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1]
module.core-infrastructure.module.k8s-nodes["jade-node-us-central-2"].google_container_node_pool.pool: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-2]
module.datarepo-app.google_service_account.datarepo_api_sa[0]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0]: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/datarepo-db-jade-private-address]
module.datarepo-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/jade-production-ip]
module.datarepo-app.google_service_account.datarepo_test_runner_sa[0]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_service_account.datarepo_sql_sa[0]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-sql@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_service_account.user-sql-service-account["production"]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/production-workload-proxy-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.sql_sa_role[0]: Refreshing state... [id=terra-datarepo-production/roles/cloudsql.client/serviceaccount:datarepo-jade-sql@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.sql_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-sql@terra-datarepo-production.iam.gserviceaccount.com/keys/2de032450696a6066d4dae9b34ac1ffe489aef6f]
module.datarepo-app.google_project_iam_member.api_sa_role[3]: Refreshing state... [id=terra-datarepo-production/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_project_iam_member.user-sql-sa-role["production"]: Refreshing state... [id=terra-datarepo-production/roles/cloudsql.client/serviceaccount:production-workload-proxy-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[1]: Refreshing state... [id=terra-datarepo-production/roles/logging.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[3]: Refreshing state... [id=terra-datarepo-production/roles/secretmanager.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[6]: Refreshing state... [id=terra-datarepo-production/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[0]: Refreshing state... [id=terra-datarepo-production/roles/container.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[2]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[5]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[7]: Refreshing state... [id=terra-datarepo-production/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[1]: Refreshing state... [id=terra-datarepo-production/roles/cloudsql.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[4]: Refreshing state... [id=terra-datarepo-production/roles/logging.logWriter/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[8]: Refreshing state... [id=terra-datarepo-production/roles/storage.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[10]: Refreshing state... [id=terra-datarepo-production/roles/container.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[9]: Refreshing state... [id=terra-datarepo-production/roles/pubsub.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[2]: Refreshing state... [id=terra-datarepo-production/roles/datastore.user/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[0]: Refreshing state... [id=terra-datarepo-production/roles/bigquery.admin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_service_account_key.user-sql-sa-key["production"]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/production-workload-proxy-sa@terra-datarepo-production.iam.gserviceaccount.com/keys/3b6c110bba50da643fa71b2c6729919b71f13e09]
module.datarepo-app.google_service_account_key.api_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com/keys/680be21dd40e7a34e4a2841674c38381d96c921c]
module.datarepo-app.google_service_account_key.test_runner_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-production.iam.gserviceaccount.com/keys/aed1f2c6275c7ab93d19725cfd436428b60ec84b]
module.datarepo-app.module.workloadid.google_service_account_iam_binding.sqlproxy_workload_identity_binding["production"]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/production-workload-proxy-sa@terra-datarepo-production.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-app.google_project_iam_member.api_sa_role[11]: Refreshing state... [id=terra-datarepo-production/roles/resourcemanager.projectIamAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Fterra-datarepo-production%2Fglobal%2Fnetworks%2Fproduction-network:servicenetworking.googleapis.com]
module.datarepo-app.vault_generic_secret.sql_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/production/datarepo-sql-sa]
module.datarepo-app.vault_generic_secret.api_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/production/datarepo-api-sa]
module.datarepo-app.vault_generic_secret.test_runner_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/production/test-runner-sa]
module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0]: Refreshing state... [id=datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"]: Refreshing state... [id=drmanager//datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"]: Refreshing state... [id=projects/terra-datarepo-production/instances/datarepo-db-jade-194e97f22b7667c6/databases/datarepo]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"]: Refreshing state... [id=projects/terra-datarepo-production/instances/datarepo-db-jade-194e97f22b7667c6/databases/stairway]
module.datarepo-app.module.cloudsql.google_sql_user.root_user[0]: Refreshing state... [id=root//datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"]: Refreshing state... [id=drmanager//datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.vault_generic_secret.sql_db_password[0]: Refreshing state... [id=secret/dsde/datarepo/production/datarepo-sql-db]
module.datarepo-alerts.google_compute_global_address.global_ip_address_prometheus: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/datarepo-prometheus-ip]
module.datarepo-alerts.data.vault_generic_secret.slack_token: Refreshing state... [id=secret/suitable/terraform/stackdriver/slack-token]
module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0]: Refreshing state... [id=projects/terra-datarepo-production/uptimeCheckConfigs/data-terra-bio]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-alerts.google_compute_global_address.global_ip_address_grafana: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/datarepo-grafana-ip]
module.datarepo-monitoring.module.user-activity-sinks.random_id.id[0]: Refreshing state... [id=GjaQ]
module.datarepo-monitoring.module.audit-log-sinks.random_id.id[0]: Refreshing state... [id=Rf3F]
module.datarepo-monitoring.module.performance-log-sinks.random_id.id[0]: Refreshing state... [id=OmSz]
module.datarepo-monitoring.module.audit-log-sinks.google_bigquery_dataset.logs[0]: Refreshing state... [id=projects/terra-datarepo-production/datasets/terra_datarepo_production_datarepo_production_audit_4586949]
module.datarepo-monitoring.module.audit-log-sinks.google_storage_bucket.logs[0]: Refreshing state... [id=terra-datarepo-production_datarepo_production_audit4586949]
module.datarepo-monitoring.module.user-activity-sinks.google_bigquery_dataset.logs[0]: Refreshing state... [id=projects/terra-datarepo-production/datasets/terra_datarepo_production_datarepo_production_audit_1717904]
module.datarepo-monitoring.module.performance-log-sinks.google_bigquery_dataset.logs[0]: Refreshing state... [id=projects/terra-datarepo-production/datasets/terra_datarepo_production_datarepo_production_audit_3826867]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_key.service-account-key: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com/keys/8140a5e48b64b68061c53487c83f9621a4fccb97]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.admin"]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.admin/serviceaccount:prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/logging.admin"]: Refreshing state... [id=terra-datarepo-production/roles/logging.admin/serviceaccount:prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.metricWriter"]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.metricWriter/serviceaccount:prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-monitoring.module.audit-log-sinks.google_logging_project_sink.bucket-log-sink[0]: Refreshing state... [id=projects/terra-datarepo-production/sinks/datarepo-production-gcs-log-sink4586949]
module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0]: Refreshing state... [id=projects/terra-datarepo-production/notificationChannels/464975950067283356]
module.datarepo-monitoring.module.audit-log-sinks.google_logging_project_sink.bigquery-log-sink[0]: Refreshing state... [id=projects/terra-datarepo-production/sinks/datarepo-production-bigquery-log-sink4586949]
module.datarepo-monitoring.module.user-activity-sinks.google_logging_project_sink.bigquery-log-sink[0]: Refreshing state... [id=projects/terra-datarepo-production/sinks/datarepo-production-bigquery-log-sink1717904]
module.datarepo-monitoring.module.performance-log-sinks.google_logging_project_sink.bigquery-log-sink[0]: Refreshing state... [id=projects/terra-datarepo-production/sinks/datarepo-production-bigquery-log-sink3826867]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/17668203417845901091]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/828731061248504616]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/12610221002304665649]
module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0]: Refreshing state... [id=terra-datarepo-production/roles/logging.configWriter]
module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.pubsub-publisher-permisson[0]: Refreshing state... [id=terra-datarepo-production/roles/pubsub.publisher]
module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-data[0]: Refreshing state... [id=terra-datarepo-production/roles/bigquery.dataOwner]
module.datarepo-monitoring.module.audit-log-sinks.google_storage_bucket_iam_member.bucket-log-writer[0]: Refreshing state... [id=b/terra-datarepo-production_datarepo_production_audit4586949/roles/storage.objectCreator/serviceaccount:p545052482238-677014@gcp-sa-logging.iam.gserviceaccount.com]
module.datarepo-monitoring.module.audit-log-sinks.google_bigquery_dataset_access.access[0]: Refreshing state... [id=projects/terra-datarepo-production/datasets/terra_datarepo_production_datarepo_production_audit_4586949]
module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.pubsub-publisher-permisson[0]: Refreshing state... [id=terra-datarepo-production/roles/pubsub.publisher]
module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-admin[0]: Refreshing state... [id=terra-datarepo-production/roles/bigquery.admin]
module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.bigquery-data[0]: Refreshing state... [id=terra-datarepo-production/roles/bigquery.dataOwner]
module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.bigquery-admin[0]: Refreshing state... [id=terra-datarepo-production/roles/bigquery.admin]
module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0]: Refreshing state... [id=terra-datarepo-production/roles/logging.configWriter]
module.datarepo-monitoring.module.performance-log-sinks.google_bigquery_dataset_access.access[0]: Refreshing state... [id=projects/terra-datarepo-production/datasets/terra_datarepo_production_datarepo_production_audit_3826867]
module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-data[0]: Refreshing state... [id=terra-datarepo-production/roles/bigquery.dataOwner]
module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-admin[0]: Refreshing state... [id=terra-datarepo-production/roles/bigquery.admin]
module.datarepo-monitoring.module.user-activity-sinks.google_bigquery_dataset_access.access[0]: Refreshing state... [id=projects/terra-datarepo-production/datasets/terra_datarepo_production_datarepo_production_audit_1717904]
module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0]: Refreshing state... [id=terra-datarepo-production/roles/logging.configWriter]
module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.pubsub-publisher-permisson[0]: Refreshing state... [id=terra-datarepo-production/roles/pubsub.publisher]
module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0]: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/9202628085327048402]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      ~ data             = (sensitive value)
      ~ data_json        = (sensitive value)
      ~ id               = "secret/suitable/terraform/stackdriver/slack-token" -> (known after apply)
      ~ lease_duration   = 2764800 -> (known after apply)
      + lease_id         = (known after apply)
      ~ lease_renewable  = false -> (known after apply)
      ~ lease_start_time = "RFC1010109" -> (known after apply)
        path             = "secret/suitable/terraform/stackdriver/slack-token"
      - version          = -1 -> null
    }

  # module.datarepo-alerts.google_logging_metric.logging_metric_error_connections_exhausted will be created
  + resource "google_logging_metric" "logging_metric_error_connections_exhausted" {
      + filter  = <<~EOT
            resource.type="k8s_container"
            AND labels.k8s-pod/app_kubernetes_io/name="datarepo-api"
            AND resource.labels.project_id="terra-datarepo-production"
            AND resource.labels.cluster_name="jade-master-us-central1"
            AND severity="ERROR"
            AND (jsonPayload.message:"Global exception handler" AND jsonPayload.message:"org.springframework.jdbc.CannotGetJdbcConnectionException")
        EOT
      + id      = (known after apply)
      + name    = "logging/user/metric_error_connections_exhausted"
      + project = (known after apply)

      + metric_descriptor {
          + metric_kind = "DELTA"
          + unit        = "1"
          + value_type  = "INT64"
        }
    }

  # module.datarepo-alerts.google_monitoring_alert_policy.log_based_alert_policy will be created
  + resource "google_monitoring_alert_policy" "log_based_alert_policy" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Error was detected"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/terra-datarepo-production/notificationChannels/464975950067283356",
        ]
      + project               = "terra-datarepo-production"

      + conditions {
          + display_name = "Connections Exhausted"
          + name         = (known after apply)

          + condition_threshold {
              + comparison = "COMPARISON_GT"
              + duration   = "60s"
              + filter     = "metric.type=\"logging/user/metric_error_connections_exhausted}\""

              + aggregations {
                  + alignment_period   = "60s"
                  + per_series_aligner = "ALIGN_DELTA"
                }
            }
        }
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        display_name = "production"
        enabled      = true
        id           = "projects/terra-datarepo-production/notificationChannels/464975950067283356"
      ~ labels       = {
          - "auth_token"   = "xoxb-12729891575-1301495169890-SUYNuZWXKWTdFGkT4W07MfGg"
          - "channel_name" = "#jade-alerts"
        } -> (known after apply)
        name         = "projects/terra-datarepo-production/notificationChannels/464975950067283356"
        project      = "terra-datarepo-production"
        type         = "slack"
        user_labels  = {}
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[0] will be created
  + resource "google_project_iam_member" "api_sa_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com"
      + project = "terra-datarepo-production"
      + role    = "roles/bigquery.admin"
    }

  # module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0] will be updated in-place
  ~ resource "google_sql_database_instance" "cloudsql_instance" {
        connection_name               = "terra-datarepo-production:us-central1:datarepo-db-jade-194e97f22b7667c6"
        database_version              = "POSTGRES_11"
        deletion_protection           = true
        first_ip_address              = "10.94.0.2"
        id                            = "datarepo-db-jade-194e97f22b7667c6"
        ip_address                    = [
            {
                ip_address     = "10.94.0.2"
                time_to_retire = ""
                type           = "PRIVATE"
            },
        ]
        name                          = "datarepo-db-jade-194e97f22b7667c6"
        private_ip_address            = "10.94.0.2"
        project                       = "terra-datarepo-production"
        region                        = "us-central1"
        self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/terra-datarepo-production/instances/datarepo-db-jade-194e97f22b7667c6"
        server_ca_cert                = [
            {
                cert             = <<~EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQ4Mzk1
                    MGI3Yi1iNDJjLTQ0NWYtYjg1ZC1kYzAzYTczOGI5ZTkxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjAwODIwMTcyNTE5WhcNMzAwODE4MTcyNjE5WjB3MS0wKwYD
                    VQQuEyQ4Mzk1MGI3Yi1iNDJjLTQ0NWYtYjg1ZC1kYzAzYTczOGI5ZTkxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQCGZppperpaAQXM2tcfJG8+1kg0pK7epAGDGwHNoQrCY1IuOYNNF1E1MNu/Mqqf
                    /qd2Cjm53lKFAEidrpseSjuyg48vv2lwOGZkpeFCM165H7FEed2r3x5TxX1X71Tl
                    7WuIsrnYU3J8SWyvOkO5B/l91z59VAXviSKKZcqIz8Ysilw2E2Xyxn8LSTP7RpAJ
                    ggwQQWqka8qixhZ2uLva6ff8EIdXKusEFb5+bowOkPc7MhISKuH2Zt3rDIZfploZ
                    jXqU4OT90duK6j/8w6xHaBGvlmQcrV8uElkklCcRzaKWATTlG+9j6TsKUPMRCRfR
                    UJkywnB2XGSk1SCB/99JJQ0zAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBAFfphIN16gP6J+iQEAD3M4vi6huC4v0Zn3ezFgRq
                    EHsoH7YRwxO5dMmc3teN/3bIEgl2pGQr1HHVr+HyAlXwx1W4er8ThexICErKBLMA
                    xKVomkLb5uI6RQ6kw/ZMq91gpUeb+Y6ejh5exBKUl3FnF8IapVq0tIn05BhHCYEf
                    5icwt4Mqx2+F5EK54mjAlB5GquJQZDUXL2hhY2MKcXzB7K1r6jk0cq3a8Mqo6ydi
                    zCl/+mgrXcsTfooa0Ujs+eDjoW3cQxsubKA/8RsaqxfPiTvo4Xght5Ue8foXeQWc
                    z9k5VESCz+W3fTpGj2ThdaHADy1NRCuE1mt9CPQduanL2X4=
                    -----END CERTIFICATE-----
                EOT
                common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=83950b7b-b42c-445f-b85d-dc03a738b9e9"
                create_time      = "2020-08-20T17:25:19.297Z"
                expiration_time  = "2030-08-18T17:26:19.297Z"
                sha1_fingerprint = "19806100a9fd9cea0847da70053b97374f2f82d5"
            },
        ]
        service_account_email_address = "p545052482238-0py55i@gcp-sa-cloud-sql.iam.gserviceaccount.com"

      ~ settings {
            activation_policy           = "ALWAYS"
            authorized_gae_applications = []
            availability_type           = "REGIONAL"
            crash_safe_replication      = false
            disk_autoresize             = true
            disk_size                   = 10
            disk_type                   = "PD_SSD"
            pricing_plan                = "PER_USE"
          + replication_type            = "SYNCHRONOUS"
            tier                        = "db-custom-2-7680"
            user_labels                 = {
                "app" = "datarepo"
                "env" = "jade"
            }
            version                     = 28

            backup_configuration {
                binary_log_enabled             = false
                enabled                        = true
                point_in_time_recovery_enabled = false
                start_time                     = "06:00"
            }

            database_flags {
                name  = "max_connections"
                value = "200"
            }

            ip_configuration {
                ipv4_enabled    = false
                private_network = "projects/terra-datarepo-production/global/networks/production-network"
                require_ssl     = true
            }

            location_preference {
                zone = "us-central1-a"
            }
        }
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-admin[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-admin" {
        etag    = "BwW19YfbgDs="
        id      = "terra-datarepo-production/roles/bigquery.admin"
      ~ members = [
          + "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.admin"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-data[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-data" {
        etag    = "BwW19YfbgDs="
        id      = "terra-datarepo-production/roles/bigquery.dataOwner"
      ~ members = [
          + "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          - "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.dataOwner"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.pubsub-publisher-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "pubsub-publisher-permisson" {
        etag    = "BwW19YfbgDs="
        id      = "terra-datarepo-production/roles/pubsub.publisher"
      ~ members = [
          + "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/pubsub.publisher"
    }

  # module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.bigquery-data[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-data" {
        etag    = "BwW19YfbgDs="
        id      = "terra-datarepo-production/roles/bigquery.dataOwner"
      ~ members = [
          + "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
          - "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.dataOwner"
    }

  # module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-log-writer-permisson" {
        etag    = "BwW19YfbgDs="
        id      = "terra-datarepo-production/roles/logging.configWriter"
      ~ members = [
          - "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/logging.configWriter"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-admin[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-admin" {
        etag    = "BwW19YfbgDs="
        id      = "terra-datarepo-production/roles/bigquery.admin"
      ~ members = [
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.admin"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-log-writer-permisson" {
        etag    = "BwW19YfbgDs="
        id      = "terra-datarepo-production/roles/logging.configWriter"
      ~ members = [
          - "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/logging.configWriter"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.pubsub-publisher-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "pubsub-publisher-permisson" {
        etag    = "BwW19YfbgDs="
        id      = "terra-datarepo-production/roles/pubsub.publisher"
      ~ members = [
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/pubsub.publisher"
    }

Plan: 3 to add, 10 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on modules/datarepo-app/cloudsql.tf line 25, in module "cloudsql":
  25:     "${local.service}" = {

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 5 more similar warnings elsewhere)


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @nmalfroy, Action: `pull_request`, Working Directory: `./datarepo`, Workflow: `Terraform Plan`*